tap "oven-sh/bun"
tap "homebrew/cask-versions"
tap "homebrew/cask"

brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "cmake"
brew "cowsay"
brew "curl"
brew "deno"
brew "fastfetch"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpg"
brew "grep"
brew "helm"
brew "jq"
brew "just"
brew "kubernetes-cli"
brew "libpq"
brew "make"
brew "nginx"
brew "nmap"
brew "opam" # caml
brew "openssl"
brew "oven-sh/bun/bun"
brew "pipx"
brew "protobuf"
brew "pup"
brew "pyenv-virtualenv"
brew "pyenv"
brew "readline"
brew "sqlite3"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tree"
brew "unzip"
brew "wget"
brew "wireguard-tools"
brew "xz"
brew "zlib"
brew "zsh-autosuggestions"

# brew "virtualenv", link: false
brew "volta"
brew "watch"
brew "yt-dlp"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "bartender"
cask "bitwarden"
cask "datagrip"
cask "discord"
cask "fig"
cask "google-chrome"
cask "iterm2"
cask "lens"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "xquartz"
cask "utm"
cask "temurin17"
cask "intellij-idea"
# @todo more casks once stable
# @todo vscode extensions
