vscode "vscode-icons-team.vscode-icons"
vscode "Equinusocio.vsc-material-theme"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "bufbuild.vscode-buf"
vscode "charliermarsh.ruff"
vscode "connor4312.nodejs-testing"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "KevinRose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "ms-python.black-formatter"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "njqdev.vscode-python-typehint"
vscode "paul-mannino.vscode-create-test-file"
vscode "pbkit.vscode-pbkit"
vscode "pomdtr.excalidraw-editor"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "TylerHarris.terraform-link-docs"
vscode "whizkydee.material-palenight-theme"
